Repository: qalqangroup/Qalqan_mobile
Catalog: lib/l10n/app_*.arb
Languages: kk

source: Welcome
kk: Қош келдіңіз

# welcomeToQalqanDsm
source: Welcome to Qalqan
kk: Qalqan-ға қош келдіңіз

# enterPassword
source: Enter a password
kk: Құпия сөздi енгізіңіз

# pleaseEnterPassword
source: Please, enter a password
kk: Өтiнiш, құпия сөздi енгізіңіз

source: Wrong password
kk: Қате құпия сөз

source: Enter
kk: Кіру

source: Password
kk: Құпия сөз

# click_back
source: Click back again to exit
kk: Шығу үшін «Артқа» түймесін қайтадан басыңыз.

source: Encrypt
kk: Шифрлау

source: Decrypt
kk: Шифр ашу

source: Save
kk: Сақтау

source: Select key type
kk: Кілт түрін таңдаңыз

source: All
kk: Барлығы

source: Session
kk: Сессиялық

source: New password
kk: Жаңа құпия сөз

source: Confirm password
kk: Құпия сөзді растаңыз

# password_mismatch
source: Passwords are mismatch
kk: Құпия сөздер сәйкес келмейді

source: Error
kk: Қате

source: Success
kk: Сәттілік

# password_saved
source: Password is saved
kk: Құпия сөз сақталды

source: Incorrect password
kk: Қате құпия сөз

source: Try again
kk: Қайта теріңіз

source: Ok
kk: Жарайды

source: Select a file
kk: Файл тіркеу

# tkphoto
source: Take a photo
kk: Фото түсіру

# tkvideo
source: Take a video
kk: Бейне түсіру

# tkrec
source: Take a record
kk: Дыбыс жазу

# txtmsg
source: Type a message . . .
kk: Хабарлама жазу . . .

# showmsg
source: Show a message
kk: Хабарлама көрсету

# pleaseselectkeytype
source: Please, select a key type
kk: Өтiнiш, кілт түрін таңдаңыз.

source: Start
kk: Бастау

source: Main
kk: Басты

source: Chat
kk: Чат

source: Profile
kk: Профиль

source: New Password
kk: Жаңа құпия сөз

source: Confirm Password
kk: Құпия сөзді растаңыз

source: Fill all fields
kk: Барлық өрістерді толтырыңыз

source: Passwords do not match
kk: Құпия сөздер сәйкес келмейді

# selectFile
source: Select a file
kk: Файлды таңдаңыз

source: Enter cipher text...
kk: Шифрланған мәтінді енгізіңіз...

# takePhoto
source: Take a photo
kk: Суретке түсіру

# takeVideo
source: Take a video
kk: Бейне түсіру

# recordAudio
source: Record an audio
kk: Аудио жазу

# typeMsg
source: Type a message...
kk: Хабарлама енгізіңіз...

source: Connecting...
kk: Қосылуда...

source: Connection established
kk: Байланыс орнатылды

source: Connected
kk: Сәтті қосылды

source: Call ended
kk: Қоңырау аяқталды

source: Disconnected
kk: Байланыс үзілді

source: Audio call
kk: Дыбыстық қоңырау

source: Video call
kk: Бейне қоңырау

source: Cancel
kk: Бас тарту

source: Call
kk: Қоңырау шалу

source: Chats
kk: Чаттар

source: No rooms
kk: Бөлмелер табылмады

source: Rooms
kk: Бөлмелер

# plsfill
source: Please fill in all fields
kk: Өтiнiш, барлық өрісті де толтырыңыз

# loginFailed
source: Login failed. Check your credentials.
kk: Кіру сәтсіз аяқталды. Терілген деректеріңізді тексеріңіз.

source: Auto-login failed
kk: Автоматты түрде кіру сәтсіз аяқталды

source: Username
kk: Пайдаланушы аты

source: Log in
kk: Кіру

source: Log out
kk: Шығу

# keyfilenf
source: Key file not found
kk: Кiлт файлы табылмады

# stopRecord
source: Stop Recording
kk: Жазуды токтату

# loggedas
source: You are logged in as
kk: Сіз жүйеге кірдіңіз

source: Change password
kk: Құпия сөзді өзгерту

source: Add user
kk: Пайдаланушыны қосу

# peopleSection
source: People
kk: Адамдар

source: Settings
kk: Параметрлер

# youLeftRoom
source: You left {roomName}
kk: Сіз {roomName} бөлмесінен шықтыңыз

source: Leave
kk: Кету

source: Ringing
kk: Қоңырау шалу

source: Unmute
kk: Дыбысты қосу

source: Mute
kk: Дыбысты өшіру

source: End
kk: Аяқтау

source: Speaker
kk: Динамик

source: Microphone
kk: Микрофон

# errorRoomEvents
source: Error receiving events: {error}
kk: Оқиғаларды алу қатесі: {error}

# loadHistoryError
source: Failed to load chat history
kk: Чат тарихын жүктеу мүмкін болмады

# sendMessageError
source: Failed to send message
kk: Хабар жіберу мүмкін болмады

# sendFileError
source: Failed to send file
kk: Файлды жіберу мүмкін болмады

# typeMessageHint
source: Type a message...
kk: Хабарламаны теріңіз...

source: Coming soon
kk: Жуырда

source: Open
kk: Ашық

# imagePlaceholder
source: [image]
kk: [сурет]

# filePlaceholder
source: [file]
kk: [файл]

source: Change password
kk: Құпия сөзді өзгерту

source: Update your password
kk: Құпия сөзіңізді жаңартыңыз

source: Current password
kk: Ағымдағы құпия сөз

source: Repeat new password
kk: Жаңа құпия сөзді қайталау

# pwStrengthWeak
source: Weak
kk: Әлсіз

# pwStrengthFair
source: Fair
kk: Әділ

# pwStrengthGood
source: Good
kk: Жақсы

# pwStrengthStrong
source: Strong
kk: Күшті

# pwMustInclude
source: Password must include:
kk: Құпия сөз мыналарды қамтуы керек:

# pwAtLeastNChars
source: At least {n} characters
kk: Кемінде {n} таңба

# pwUpperLower
source: Uppercase and lowercase letters
kk: Бас және кіші әріптер

# pwAtLeastOneNumber
source: At least one number
kk: Кемінде бір сан

# pwAtLeastOneSpecial
source: At least one special character
kk: Кемінде бір арнайы таңба

# pwMustMeetRequirements
source: Password must meet the requirements below
kk: Құпия сөз төмендегі талаптарға сай болуы керек

source: Password changed
kk: Пароль өзгертілді

source: Failed to change password
kk: Құпия сөзді өзгерту мүмкін болмады

# logoutOtherDevices
source: Log out on other devices
kk: Басқа құрылғыларда жүйеден шығу

# newChatTitle
source: New chat
kk: Жаңа чат

# startChatTitle
source: Start Chat
kk: Чатты бастау

# userLoginLabel
source: User Login
kk: Пайдаланушы логині

# startChatButton
source: Start Chat
kk: Чатты бастау

# answeredelsewhere
source: Answered on another device
kk: Басқа құрылғыдан жауап берілді

# enterLoginPlease
source: Please enter a login
kk: Логин енгізіңіз

source: User not found on server
kk: Пайдаланушы серверден табылмады

source: Failed to create chat
kk: Чатты жасау мүмкін болмады

source: Warning: couldn’t update direct rooms
kk: Назар аударыңыз: тікелей чатты жаңарту мүмкін болмады

# saveFileQuestion
source: Save file?
kk: Файлды сақтау керек пе?

source: Yes
kk: Иә

source: No
kk: Жоқ

# saveFileExplanation
source: File saved temporary. Would you to save file to Downloads?
kk: Файл қазір уақытша сақталады. Оны жүктеп алғыңыз келеді ме?

# fileSaved
source: File saved: {path}
kk: Файл сақталды: {path}

# errorSavingFile
source: Can't save file
kk: Файлды сақтау сәтсіз аяқталды

# attach
source: Attach file
kk: Файлды қосу
